[EquipmentEvilHuntress HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Animus"
EquipmentDescription="Hurls HEROIC arrows at your opponents. Only will follow a Huntress."
RandomBaseNames[0]=(StringValue="Huntress Animus")

[EquipmentEvilSquire HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Animus"
EquipmentDescription="Hurls HEROIC arrows at your opponents. Only will follow a Squire."
RandomBaseNames[0]=(StringValue="Squire Animus")

[EquipmentEvilMonk HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Animus"
EquipmentDescription="Hurls HEROIC arrows at your opponents. Only will follow a Monk."
RandomBaseNames[0]=(StringValue="Monk Animus")

[EquipmentEvilMage HeroEquipment_Familiar_WithProjectileAI]
EquipmentName="Animus"
EquipmentDescription="Hurls HEROIC arrows at your opponents. Only will follow an Apprentice."
RandomBaseNames[0]=(StringValue="Apprentice Animus")

[EquipmentGuardianMage HeroEquipment_Familiar_TowerBooster]
EquipmentName="Guardian"
EquipmentDescription="Apprentice Guardian: Increases nearby Defense's Damage or Effectiveness."
RandomBaseNames[0]=(StringValue="Apprentice Guardian")
EquipmentStatNames[3]="Defense Damage Boost"
EquipmentStatNames[4]="Guardian's Range"
EquipmentStatNames[5]="Defense Rate Boost"
EquipmentStatNames[6]="Defense Resistance Boost"
EquipmentStatNames[7]="Defense Range Boost"
EquipmentStatNames[9]="Number of Defenses to Boost"

[EquipmentGuardianSquire HeroEquipment_Familiar_TowerBooster]
EquipmentName="Guardian"
EquipmentDescription="Squire Guardian: Increases nearby Defense's damage resistance."
RandomBaseNames[0]=(StringValue="Squire Guardian")
EquipmentStatNames[3]="Defense Damage Boost"
EquipmentStatNames[4]="Guardian's Range"
EquipmentStatNames[5]="Defense Rate Boost"
EquipmentStatNames[6]="Defense Resistance Boost"
EquipmentStatNames[7]="Defense Range Boost"
EquipmentStatNames[9]="Number of Defenses to Boost"

[EquipmentGuardianHuntress HeroEquipment_Familiar_TowerBooster]
EquipmentName="Guardian"
EquipmentDescription="Huntress Guardian: Increases nearby Defense's attack rate."
RandomBaseNames[0]=(StringValue="Huntress Guardian")
EquipmentStatNames[3]="Defense Damage Boost"
EquipmentStatNames[4]="Guardian's Range"
EquipmentStatNames[5]="Defense Rate Boost"
EquipmentStatNames[6]="Defense Resistance Boost"
EquipmentStatNames[7]="Defense Range Boost"
EquipmentStatNames[9]="Number of Defenses to Boost"

[EquipmentGuardianMonk HeroEquipment_Familiar_TowerBooster]
EquipmentName="Guardian"
EquipmentDescription="Monk Guardian: Increases nearby Defense's effective range."
RandomBaseNames[0]=(StringValue="Monk Guardian")
EquipmentStatNames[3]="Defense Damage Boost"
EquipmentStatNames[4]="Guardian's Range"
EquipmentStatNames[5]="Defense Rate Boost"
EquipmentStatNames[6]="Defense Resistance Boost"
EquipmentStatNames[7]="Defense Range Boost"
EquipmentStatNames[9]="Number of Defenses to Boost"
